In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Company':['Apple', 'Apple', 'Facebook', 'Facebook', 'Google', 'Google'], 'Employee':['Joe', 'Sarah', 'Dan', 'James', 'Laura', 'Tim'], 'Salary':[200,120,130,150,210,180]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    Company Employee  Salary
0     Apple      Joe     200
1     Apple    Sarah     120
2  Facebook      Dan     130
3  Facebook    James     150
4    Google    Laura     210
5    Google      Tim     180

In [6]:
byfirm = df.groupby('Company')

In [7]:
byfirm.mean()

          Salary
Company
Apple        160
Facebook     140
Google       195

In [8]:
byfirm.std()

             Salary
Company
Apple     56.568542
Facebook  14.142136
Google    21.213203

In [10]:
byfirm.sum().loc['Google']

Salary    390
Name: Google, dtype: int64

In [11]:
df.groupby('Company').sum().loc['Apple']

Salary    320
Name: Apple, dtype: int64

In [13]:
df.groupby('Company').max() #In employee col. (which is a string) max() fn calculates by alphabetical order!

         Employee  Salary
Company
Apple       Sarah     200
Facebook    James     150
Google        Tim     210

In [14]:
df.groupby("Company").describe()

         Salary
          count   mean        std    min    25%    50%    75%    max
Company
Apple       2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0
Facebook    2.0  140.0  14.142136  130.0  135.0  140.0  145.0  150.0
Google      2.0  195.0  21.213203  180.0  187.5  195.0  202.5  210.0

In [15]:
df.groupby("Company").describe().transpose()

Company            Apple    Facebook      Google
Salary count    2.000000    2.000000    2.000000
       mean   160.000000  140.000000  195.000000
       std     56.568542   14.142136   21.213203
       min    120.000000  130.000000  180.000000
       25%    140.000000  135.000000  187.500000
       50%    160.000000  140.000000  195.000000
       75%    180.000000  145.000000  202.500000
       max    200.000000  150.000000  210.000000